avrxml/AS6-Devices-XML/ATSAM3U1C.xml
          </instance>
        </module>
      <module name="FUSES" id="FUSES">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="LOCKBIT">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
      <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module>
        <module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module>
        <module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module>
      </peripherals>
      
      
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
      <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B2A01F"/>
          <property name="CHIPID_CIDR" value="0x28090560"/>
          <property name="CHIPID_EXID" value="0x0"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Analog-to-digital Converter" name="ADC" version="6051K">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL"/>
          <bitfield caption="Resolution" mask="0x00000010" name="LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x007F0000" name="STARTUP"/>
          <bitfield caption="Sample &amp; Hold Time" mask="0x0F000000" name="SHTIM"/>
        </register>
        <register caption="Channel Enable Register" name="ADC_CHER" offset="0x10" rw="W" size="4">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Enable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Enable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Enable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Enable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Enable" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Channel Disable Register" name="ADC_CHDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Disable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Disable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Disable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Disable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Disable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Disable" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Channel Status Register" name="ADC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Status" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Status" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Status" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Status" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Status" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Status" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Status Register" name="ADC_SR" offset="0x1C" rw="R" size="4">
          <bitfield caption="End of Conversion 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Overrun Error 0" mask="0x00000100" name="OVRE0"/>
          <bitfield caption="Overrun Error 1" mask="0x00000200" name="OVRE1"/>
          <bitfield caption="Overrun Error 2" mask="0x00000400" name="OVRE2"/>
          <bitfield caption="Overrun Error 3" mask="0x00000800" name="OVRE3"/>
          <bitfield caption="Overrun Error 4" mask="0x00001000" name="OVRE4"/>
          <bitfield caption="Overrun Error 5" mask="0x00002000" name="OVRE5"/>
          <bitfield caption="Overrun Error 6" mask="0x00004000" name="OVRE6"/>
          <bitfield caption="Overrun Error 7" mask="0x00008000" name="OVRE7"/>
          <bitfield caption="Data Ready" mask="0x00010000" name="DRDY"/>
          <bitfield caption="General Overrun Error" mask="0x00020000" name="GOVRE"/>
          <bitfield caption="End of RX Buffer" mask="0x00040000" name="ENDRX"/>
          <bitfield caption="RX Buffer Full" mask="0x00080000" name="RXBUFF"/>
        </register>
        <register caption="Last Converted Data Register" name="ADC_LCDR" offset="0x20" rw="R" size="4">
          <bitfield caption="Last Data Converted" mask="0x000003FF" name="LDATA"/>
        </register>
        <register caption="Interrupt Enable Register" name="ADC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Enable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Enable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Enable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Enable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Enable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Enable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Enable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Overrun Error Interrupt Enable 0" mask="0x00000100" name="OVRE0"/>
          <bitfield caption="Overrun Error Interrupt Enable 1" mask="0x00000200" name="OVRE1"/>
          <bitfield caption="Overrun Error Interrupt Enable 2" mask="0x00000400" name="OVRE2"/>
          <bitfield caption="Overrun Error Interrupt Enable 3" mask="0x00000800" name="OVRE3"/>
          <bitfield caption="Overrun Error Interrupt Enable 4" mask="0x00001000" name="OVRE4"/>
          <bitfield caption="Overrun Error Interrupt Enable 5" mask="0x00002000" name="OVRE5"/>
          <bitfield caption="Overrun Error Interrupt Enable 6" mask="0x00004000" name="OVRE6"/>
          <bitfield caption="Overrun Error Interrupt Enable 7" mask="0x00008000" name="OVRE7"/>
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00010000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Enable" mask="0x00020000" name="GOVRE"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00040000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00080000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Disable Register" name="ADC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Disable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Disable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Disable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Disable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Disable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Disable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Disable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Overrun Error Interrupt Disable 0" mask="0x00000100" name="OVRE0"/>
          <bitfield caption="Overrun Error Interrupt Disable 1" mask="0x00000200" name="OVRE1"/>
          <bitfield caption="Overrun Error Interrupt Disable 2" mask="0x00000400" name="OVRE2"/>
          <bitfield caption="Overrun Error Interrupt Disable 3" mask="0x00000800" name="OVRE3"/>
          <bitfield caption="Overrun Error Interrupt Disable 4" mask="0x00001000" name="OVRE4"/>
          <bitfield caption="Overrun Error Interrupt Disable 5" mask="0x00002000" name="OVRE5"/>
          <bitfield caption="Overrun Error Interrupt Disable 6" mask="0x00004000" name="OVRE6"/>
          <bitfield caption="Overrun Error Interrupt Disable 7" mask="0x00008000" name="OVRE7"/>
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00010000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x00020000" name="GOVRE"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00040000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00080000" name="RXBUFF"/>
        </register>
